Revit 2027 API
ColorFillSchemeEntry.GetElementIdValue Method
 Gets the ElementId value stored within the entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetElementIdValue()
Public Function GetElementIdValue As ElementId
public:
ElementId^ GetElementIdValue()
member GetElementIdValue : unit -> ElementId
Return Value
ElementId
 The ElementId contained in the entry.
Remarks
 This method should only be used if the StorageType property reports the type of the entry as a ElementId.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace